package com.drivingSchool.app.core;

/**
 * Создаем класс {@link Config}, который будет реализовывать логику dataclass (Аналог из python)
 * <p>
 * Т.е. под капотом будет создаваться класс, который наследован от java.lang.Record,
 * создавая поля из переданных аргументов в конструктор, который в свою очередь тоже
 * будет создан автоматически. Поля будут иметь геттеры одноименные с переданными аргументами,
 * также все они будут final.
 * <p>
 * Также тут реализованы методы equals() и hashCode() - в зависимости от аргументов, а также toString()
 *
 * @param api - способ взаимодействия пользователя и бота
 * @param saveMode - способ сохранения информации, которая передается боту.
 */
public record Config(String api, String saveMode) {}
